-- Реализация с помощью смещения текущей даты
SELECT COUNT(DISTINCT "Н_ЛЮДИ"."ИД")
    AS "Количество студентов"
FROM "Н_ЛЮДИ"
    JOIN "Н_УЧЕНИКИ"
        ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    JOIN "Н_ПЛАНЫ" ON "Н_ПЛАНЫ"."ИД" = "Н_УЧЕНИКИ"."ПЛАН_ИД"
WHERE "Н_ПЛАНЫ"."ФО_ИД" = 2
  AND "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ" < CURRENT_DATE - INTERVAL '25 years';

-- Реализация с помощью встроенных функций
SELECT COUNT(DISTINCT "Н_ЛЮДИ"."ИД")
    AS "Количество студентов"
FROM "Н_ЛЮДИ"
    JOIN "Н_УЧЕНИКИ"
        ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    JOIN "Н_ПЛАНЫ" ON "Н_ПЛАНЫ"."ИД" = "Н_УЧЕНИКИ"."ПЛАН_ИД"
WHERE "Н_ПЛАНЫ"."ФО_ИД" = 2
  AND EXTRACT(YEAR FROM AGE("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) > 25;

-- Реализация без DISTINCT с помощью IN
SELECT COUNT("ИД")
    AS "Количество студентов"
FROM "Н_ЛЮДИ"
WHERE "ДАТА_РОЖДЕНИЯ" < CURRENT_DATE - INTERVAL '25 years'
  AND "ИД" IN (
      SELECT "Н_УЧЕНИКИ"."ЧЛВК_ИД"
      FROM "Н_УЧЕНИКИ"
          JOIN "Н_ПЛАНЫ"
              ON "Н_ПЛАНЫ"."ИД" = "Н_УЧЕНИКИ"."ПЛАН_ИД"
      WHERE "Н_ПЛАНЫ"."ФО_ИД" = 2
    );

-- Реализация без DISTINCT с помощью EXISTS
SELECT COUNT("ИД")
    AS "Количество студентов"
FROM "Н_ЛЮДИ"
WHERE "ДАТА_РОЖДЕНИЯ" < CURRENT_DATE - INTERVAL '25 years'
  AND EXISTS(
      SELECT 1
      FROM "Н_УЧЕНИКИ"
          JOIN "Н_ПЛАНЫ"
              ON "Н_ПЛАНЫ"."ИД" = "Н_УЧЕНИКИ"."ПЛАН_ИД"
      WHERE "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
        AND "Н_ПЛАНЫ"."ФО_ИД" = 2
    )
