-- Реализация с использованием DISTINCT
SELECT "ОТЧЕСТВО",
       COUNT("ИД") AS "Число людей"
FROM "Н_ЛЮДИ"
WHERE "ОТЧЕСТВО" IS NOT NULL
  AND "ОТЧЕСТВО" != '.'
  -- Отчества, встречающиеся только у преподавателей
  AND "ОТЧЕСТВО" IN (
      SELECT "Н_ЛЮДИ"."ОТЧЕСТВО"
      FROM "Н_ЛЮДИ"
          JOIN "Н_СЕССИЯ"
              ON "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
      WHERE "ОТЧЕСТВО" IS NOT NULL
        AND "ОТЧЕСТВО" != '.'
    )
  -- Отчества, встречающие больше 10 раз
  AND "ОТЧЕСТВО" IN (
      SELECT "Н_ЛЮДИ"."ОТЧЕСТВО"
      FROM "Н_ЛЮДИ"
          JOIN "Н_УЧЕНИКИ"
              ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
          JOIN "Н_ПЛАНЫ"
              ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
      WHERE "Н_ПЛАНЫ"."ФО_ИД" = 1
        AND "ОТЧЕСТВО" IS NOT NULL
        AND "ОТЧЕСТВО" != '.'
      GROUP BY "Н_ЛЮДИ"."ОТЧЕСТВО"
      HAVING COUNT(DISTINCT "Н_ЛЮДИ"."ИД") > 10
    )
GROUP BY "ОТЧЕСТВО";

-- Реализация без использования DISTINCT (с помощью подзапроса в FROM)
SELECT "ОТЧЕСТВО",
       COUNT("ИД") AS "Число людей"
FROM "Н_ЛЮДИ"
WHERE "ОТЧЕСТВО" IS NOT NULL
  AND "ОТЧЕСТВО" != '.'
  -- Отчества, встречающиеся только у преподавателей
  AND "ОТЧЕСТВО" IN (
      SELECT "Н_ЛЮДИ"."ОТЧЕСТВО"
      FROM "Н_ЛЮДИ"
          JOIN "Н_СЕССИЯ"
              ON "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
      WHERE "ОТЧЕСТВО" IS NOT NULL
        AND "ОТЧЕСТВО" != '.'
    )
  -- Отчества, встречающие больше 10 раз
  AND "ОТЧЕСТВО" IN (
      SELECT "Очники"."ОТЧЕСТВО"
      FROM (
          SELECT "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ЛЮДИ"."ИД"
          FROM "Н_ЛЮДИ"
          WHERE "Н_ЛЮДИ"."ОТЧЕСТВО" IS NOT NULL
            AND "Н_ЛЮДИ"."ОТЧЕСТВО" != '.'
            AND EXISTS (
                SELECT 1
                FROM "Н_УЧЕНИКИ"
                    JOIN "Н_ПЛАНЫ"
                        ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
                WHERE "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
                  AND "Н_ПЛАНЫ"."ФО_ИД" = 1
            )
        ) AS "Очники"
      GROUP BY "Очники"."ОТЧЕСТВО"
      HAVING COUNT("Очники"."ИД") > 10
    )
GROUP BY "ОТЧЕСТВО"
