-- Реализация с использованием DISTINCT
SELECT DISTINCT
    "Н_ЛЮДИ"."ИД" AS "Номер студента",
    "Н_ЛЮДИ"."ФАМИЛИЯ" AS "Фамилия",
    "Н_ЛЮДИ"."ИМЯ" AS "Имя",
    "Н_ЛЮДИ"."ОТЧЕСТВО" AS "Отчество"
FROM "Н_ЛЮДИ"
    JOIN "Н_УЧЕНИКИ"
        ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ФАМИЛИЯ" IS NOT NULL
  AND "Н_ЛЮДИ"."ФАМИЛИЯ" != '.'
  AND "Н_ЛЮДИ"."ФАМИЛИЯ" IN (
    SELECT "Н_ЛЮДИ"."ФАМИЛИЯ"
    FROM "Н_ЛЮДИ"
        JOIN "Н_УЧЕНИКИ"
            ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    GROUP BY "Н_ЛЮДИ"."ФАМИЛИЯ"
    HAVING COUNT(DISTINCT "Н_ЛЮДИ"."ИД") > 1
)
ORDER BY "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ";

-- Реализация с использованием EXISTS
SELECT
    "Л1"."ИД" AS "Номер студента",
    "Л1"."ФАМИЛИЯ" AS "Фамилия",
    "Л1"."ИМЯ" AS "Имя",
    "Л1"."ОТЧЕСТВО" AS "Отчество"
FROM "Н_ЛЮДИ" "Л1"
WHERE "Л1"."ФАМИЛИЯ" IS NOT NULL
  AND "Л1"."ФАМИЛИЯ" != '.'
  AND EXISTS(
    SELECT 1
    FROM "Н_УЧЕНИКИ" "У1"
    WHERE "Л1"."ИД" = "У1"."ЧЛВК_ИД"
    )
  AND EXISTS(
    SELECT 1
    FROM "Н_ЛЮДИ" "Л2"
        JOIN "Н_УЧЕНИКИ" "У2"
            ON "Л2"."ИД" = "У2"."ЧЛВК_ИД"
    WHERE "Л1"."ФАМИЛИЯ" = "Л2"."ФАМИЛИЯ"
      AND "Л1"."ИД" != "Л2"."ИД"
    )
ORDER BY "Л1"."ФАМИЛИЯ", "Л1"."ИМЯ"
