-- Таблица со средними оценками студентов группы 4100, равными средней оценке в группе 1101
SELECT
    "Н_ЛЮДИ"."ИД"
        AS "Номер",
    CONCAT_WS(' ', "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО")
        AS "ФИО",
    ROUND(AVG(CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS NUMERIC)), 2)
        AS "Средняя оценка"
FROM "Н_ЛЮДИ"
    JOIN "Н_УЧЕНИКИ"
        ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    JOIN "Н_ВЕДОМОСТИ"
        ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
WHERE "Н_УЧЕНИКИ"."ГРУППА" = '4100'
  AND "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[0-9]+$'
GROUP BY
    "Н_ЛЮДИ"."ИД",
    "Н_ЛЮДИ"."ФАМИЛИЯ",
    "Н_ЛЮДИ"."ИМЯ",
    "Н_ЛЮДИ"."ОТЧЕСТВО"
HAVING ROUND(AVG(CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS NUMERIC)), 2) =
       (
        SELECT ROUND(AVG(CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS NUMERIC)), 2)
        FROM "Н_ВЕДОМОСТИ"
            JOIN "Н_УЧЕНИКИ"
                ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
        WHERE "Н_УЧЕНИКИ"."ГРУППА" = '1101'
          AND "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[0-9]+$'
        );

-- Средняя оценка в группе 1101
SELECT ROUND(AVG(CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS NUMERIC)), 2)
        FROM "Н_ВЕДОМОСТИ"
            JOIN "Н_УЧЕНИКИ"
                ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
        WHERE "Н_УЧЕНИКИ"."ГРУППА" = '1101'
          AND "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[0-9]+$'
