SELECT
    "Н_УЧЕНИКИ"."ГРУППА" AS "Номер группы",
    "Н_ЛЮДИ"."ИД" AS "Номер студента",
    "Н_ЛЮДИ"."ФАМИЛИЯ" AS "Фамилия",
    "Н_ЛЮДИ"."ИМЯ" AS "Имя",
    "Н_ЛЮДИ"."ОТЧЕСТВО" AS "Отчество",
    "Н_УЧЕНИКИ"."П_ПРКОК_ИД" AS "Номер пункта приказа",
    "Н_УЧЕНИКИ"."СОСТОЯНИЕ" AS "Состояние пункта приказа"
FROM "Н_ЛЮДИ"
    JOIN "Н_УЧЕНИКИ"
        ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    JOIN "Н_ПЛАНЫ"
        ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
    JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ"
        ON "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД" = "Н_ПЛАНЫ"."ФО_ИД"
    JOIN "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"
        ON "Н_ПЛАНЫ"."НАПС_ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД"
    JOIN "Н_НАПР_СПЕЦ"
        ON "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД" = "Н_НАПР_СПЕЦ"."ИД"
WHERE "Н_УЧЕНИКИ"."НАЧАЛО" > TIMESTAMP '2012-09-01'
  AND "Н_ПЛАНЫ"."КУРС" = 1
  AND "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
  AND "Н_НАПР_СПЕЦ"."НАИМЕНОВАНИЕ" = 'Программная инженерия'
